In [1]:
import pandas as pd

data = [[1, 'John', 100000, 6, '4/1/2006'], [2, 'Amy', 12000, 5, '5/1/2010'], [3, 'Mark', 65000, 12, '12/25/2008'], [4, 'Pam', 25000, 25, '1/1/2005'], [5, 'Alex', 5000, 10, '2/3/2007']]
sales_person = pd.DataFrame(data, columns=['sales_id', 'name', 'salary', 'commission_rate', 'hire_date']).astype({'sales_id':'Int64', 'name':'object', 'salary':'Int64', 'commission_rate':'Int64', 'hire_date':'datetime64[ns]'})
data = [[1, 'RED', 'Boston'], [2, 'ORANGE', 'New York'], [3, 'YELLOW', 'Boston'], [4, 'GREEN', 'Austin']]
company = pd.DataFrame(data, columns=['com_id', 'name', 'city']).astype({'com_id':'Int64', 'name':'object', 'city':'object'})
data = [[1, '1/1/2014', 3, 4, 10000], [2, '2/1/2014', 4, 5, 5000], [3, '3/1/2014', 1, 1, 50000], [4, '4/1/2014', 1, 4, 25000]]
orders = pd.DataFrame(data, columns=['order_id', 'order_date', 'com_id', 'sales_id', 'amount']).astype({'order_id':'Int64', 'order_date':'datetime64[ns]', 'com_id':'Int64', 'sales_id':'Int64', 'amount':'Int64'})

In [12]:
df = orders.merge(right=company, how='left', left_on='com_id', right_on='com_id')
df

   order_id order_date  com_id  sales_id  amount    name    city
0         1 2014-01-01       3         4   10000  YELLOW  Boston
1         2 2014-02-01       4         5    5000   GREEN  Austin
2         3 2014-03-01       1         1   50000     RED  Boston
3         4 2014-04-01       1         4   25000     RED  Boston

In [18]:
df = df.where(df['name'] == 'RED')['sales_id'].to_frame()
df

   sales_id
0      <NA>
1      <NA>
2         1
3         4

In [45]:
sales_person['sales_id'].isin(df['sales_id'])

0     True
1    False
2    False
3     True
4    False
Name: sales_id, dtype: boolean

In [46]:
sales_person[sales_person['sales_id'].isin(df['sales_id'])]

   sales_id  name  salary  commission_rate  hire_date
0         1  John  100000                6 2006-04-01
3         4   Pam   25000               25 2005-01-01

In [47]:
sales_person[~sales_person['sales_id'].isin(df['sales_id'])]

   sales_id  name  salary  commission_rate  hire_date
1         2   Amy   12000                5 2010-05-01
2         3  Mark   65000               12 2008-12-25
4         5  Alex    5000               10 2007-02-03

In [48]:
sales_person[~sales_person['sales_id'].isin(df['sales_id'])][['name']]

   name
1   Amy
2  Mark
4  Alex